tap "caskroom/cask"
tap "buildkite/buildkite"

cask_args appdir: "/Applications"

# Mac apps
# We skip these if they exist, otherwise they can download every time

cask "gpg-suite"
cask "visual-studio-code"
cask "postgres"
cask "adobe-creative-cloud"
cask "docker"
cask "imageoptim"
cask "noun-project"
cask "color-oracle"
cask "sketch"
cask "slack"
cask "basecamp"
cask "google-chrome"
cask "dropbox"
cask "zoomus"
cask "encryptme"
cask "firefox"
cask "gifski"
cask "krisp"

mas("Tweetbot", id: 557168941)
mas("Typeface", id: 1062679359)
mas("Giphy", id: 668208984)
mas("DaisyDisk", id: 411643860)
mas("Deckset", id: 847496013)
mas("Giphy", id: 668208984)
mas("Gifski", id: 1351639930)

# Services

brew "redis"

# Cli stuff

# dotfile bash stuff
brew "bash-git-prompt"
brew "bash-completion"

# Dev

brew "git"
brew "diff-so-fancy"
brew "yarn"
brew "shellcheck"
brew "jq"
brew "watchman"
brew "buildkite-agent", args: ["devel"]
brew "goreman"

# Git GPG helpers
brew "pinentry-mac"
brew "pinentry"

# Golang

brew "go"

# Node

brew "node"

# SSH

brew "sekey"

# Random dev deps

brew "puma/puma/puma-dev"
brew "autoconf"
brew "coreutils"
brew "gnu-tar"
brew "mtr"
brew "sqlite"
brew "automake"
brew "pkg-config"
brew "libgcrypt"
brew "libxslt"
brew "openssl"
brew "readline"
brew "libksba"
brew "makedepend"

# XCode dev

brew "carthage"

# Ruby dep stuff

brew "rbenv"
brew "rbenv-communal-gems"
brew "ruby-build"
brew "libxml2"

# Node dep stuff
brew "libpng" # for the Buildkite frontend
brew "libtool" # for the Buildkite frontend

# AWS tools
cask "aws-vault"
brew "awscli"
